[
    {
        "id": 0,
        "name": "Op weg naar 5g",
        "location": "Sint-Truiden",
        "text": "Het seminarie van Ericsson ging online door op woensdag 25 november. Dit seminarie had als titel  ‘op weg naar 5G’. Het 5G netwerk verschijnt de laatste tijd steeds vaker in de media, zowel door bijvoorbeeld nieuwe infrastructuur die geplaatst wordt als door completdenkers die het afbreken. Het seminarie werd gebracht door twee sprekers, Tijs Van den Brande en Serge Vanhoffelen. <br> <br> Het bedrijf dat dit seminarie aanbood was Ericsson. In het eerste deel werd door spreker Tijs Van den Brande een korte intro gegeven. Ericsson was vroeger gefocust op het creëren van mobiele telefoons, in tegenstelling tot nu waar Ericsson zich focust op het maken van 5G-infrastructuur. De evolutie van telefonie en de manier van werking werd uitgelegd, samen met de principes van 1 tot en met 5G. Hierna nam de tweede spreker, Serge Vanhoffelen, het woord. Hij legde enkele toepassingen van 5G uit. Een voorbeeld hiervan was remote work bij mijnwerken. Zo konden mijnwerkers een gecontroleerde explosie bovengronds laten gebeuren, zodat ze minder risico zouden lopen op verwondingen of erger. Een ander voorbeeld was Tactile Internet. Dit is een vorm van low latency internet. Hierdoor is het bijvoorbeeld mogelijk om aan de hand van een handschoen uitgerust met druksensoren en een vr-bril te interageren met virtuele objecten, en deze te voelen. Het deel dat hierop volgde ging sterk over het technische aspect van 5G en hoe alles ongeveer in elkaar zat. Zo kwamen ook enkele facts and figures aan bod, zoals de verschillen tussen 4G en 5G. <br> <br> Het laatste deel van de presentatie ging over de opzet van 5G wereldwijd en in België. Ook werd duidelijk gemaakt dat 5G geen schadelijke gevolgen heeft voor de mens, in tegenstelling tot wat een aantal complotdenkers beweren. Er bestaat namelijk geen enkel paper dat dit ook maar enigszins kan bewijzen. Dit concludeerde het seminarie in verband met 5G. <br> <br> Persoonlijk kende ik al een beetje over 5G, toch heb ik tijdens dit seminarie veel bijgeleerd. Ook zat er een goede algemene structuur in de presentatie. In de voordracht werd aangehaald hoelang 5G al in productie is, namelijk ongeveer tien jaar. Dit verbaasde me, aangezien ik me nog ongeveer kan herinneren wanneer 4G uitgebracht werd. Ook had ik nooit stilgestaan bij de verschillende toepassingen van 5G. Ik dacht altijd dat de evolutie van 4G naar 5G draaide rond nog sneller mobiel internet, maar 5G maakt dus veel meer toepassingen mogelijk. Mede daarom steekt het in enkele delen van de wereld al de kop op. Helaas dreigt België hier een beetje de boot te missen, aangezien de goedkeuring van het voorstel hiervoor werd uitgesteld door de val van de vorige regering. Wel maakte de spreker ons snel duidelijk dat onze 4G smartphone nog jaren zijn nut zal vervullen. De industriële toepassingen die 5G biedt lijken me interessanter dan de <i> consumer side </i> van dit verhaal. Dit echter omdat in een tijd waarin alles sneller moet, ik persoonlijk 4G snel genoeg vind. Dit is misschien geen goede mindset voor een IT’er, maar ik leun hierbij aan bij een ander motto binnen IT, namelijk: <i> “if it ain't broke, don't fix it” </i>, “als het werkt, werkt het”. De cases die werden uitgelegd zijn werkelijk een meerwaarde voor de samenleving door onder andere veiligheid en innovatie te voorzien. Hierdoor verander ik dus graag mijn mening over het 5G netwerk. Iets dat ik bijgeleerd heb is dat ik best meer open-minded ben voor soortgelijke zaken. Hopelijk is het 5G netwerk dus snel overal beschikbaar in België. ",
        "selected": "False",
        "images": "5g.PNG"
    },
    {
        "id": 1,
        "name": "Uitdagingen in de wereld van e-forensics & cybercrime",
        "location": "Sint-Truiden",
        "text": "Op woensdag 16 december 2020 ging het seminarie ‘RCCU ( <i> Regional Computer Crime Unit </i>): Uitdagingen in de wereld van <i> e-forensics </i> & Cybercrime’ online door. Het werd gebracht door spreker Manuel Schaeken, hoofdinspecteur bij de politie en afdelingshoofd bij de <i> computer crime unit </i>. Ik hoopte iets meer te leren over de verschillende zaken die de <i> computer crime unit </i> onderzoekt, en welke programma’s deze hiervoor gebruikt. <br> <br> De spreker begon met een korte opsomming van de verschillende aspecten waar een computer crime unit mee in contact komt. Vervolgens legde hij uit hoe de RCCU’s vallen binnen de federale politie. Er zijn veertien RCCU’s in België die gelijk verdeeld zijn over de gerechtelijke arrondissementen. Ook is er een FCCU (Federal Computer Crime Unit). Deze is gelokaliseerd in Brussel en hier is er maar één van. De RCCU’s en de FCCU behoren tot de federale politie. De RCCU’s werken op hun beurt dan weer samen met de lokale politiebureaus. Wanneer bijvoorbeeld een ondernemer vermoedt dat zijn bedrijf slachtoffer is van cybercrime, stapt deze naar de lokale politie. Vervolgens wisselen die de informatie dan uit met de gepaste RCCU. In sommige instanties heeft een RCCU direct contact met het mogelijk slachtoffer. De spreker ging ook dieper in op forensische analyse. Eveneens kwam het Electronic Discovery Reference Model aan bod, dit is een stappenplan dat de verschillende stappen bij het ontdekken van elektronische informatie weergeeft. Ook hier liet de spreker zien dat dit niet altijd even makkelijk ging, bijvoorbeeld wanneer iemand de computer bewust heeft vernietigd. Hierna had de spreker het over apparatuur/software die criminelen gebruiken (zoals bijvoorbeeld een toestel met dual boot) om ervoor te zorgen dat hun smartphone geen zichtbare informatie bevat als die in handen valt van de autoriteiten. Gedurende de rest van de presentatie werden meer cases aangehaald. De spreker vertelde ook geregeld wat elke partij zijn rechten en plichten waren in verschillende situaties. Eveneens werd er iets meer uitleg gegeven over het dark web. Andere frauduleuze software / praktijken zoals ransomware en (spear)fishing kwamen ook aan bod, samen met andere recente technologieën die criminelen gebruiken. De presentatie eindigde met een oproep dat er voor bachelor studenten informatica zeker een job te vinden is binnen de politie. <br> <br> Op zich vond ik de presentatie zeer spannend. Dat er verschillende RCCU’s zijn binnen de politie die zich bezighouden met cybercrime is nieuw voor mij. Ik dacht altijd dat er maar één centraal orgaan in Brussel was dat zich hiermee bezig hield. Ook dacht ik dat het hele seminarie enkel zou opgebouwd zijn rond software, maar dit was niet het geval. Zo werd er, zoals eerder vermeld, gepraat over smartphones die met een <i> dual boot </i> werken, zodat er altijd een “cleane” façade is en criminelen makkelijker hun geheime info kunnen verbergen. Ook kunnen deze smartphones, mits het geven van een juiste inlogcode, vanaf het startscherm leeggemaakt worden. De presentatie heeft heel wat zaken voor mij verduidelijkt. De spreker nam tijdens de presentatie ook ruimschoots de tijd om vragen van de luisteraars te beantwoorden. Het tempo nam iets toe tegen het einde van de presentatie, maar toch bleef deze steeds makkelijk te volgen. Ik denk persoonlijk dat dit seminarie wel wat interesse heeft opgewekt bij de luisteraars, omdat er toch enkele  vragen waren in verband met het aanbod voor tewerkstelling. <br> <br> Al was het over het algemeen heel boeiend, toch denk ik niet dat een job binnen de politie voor mij weggelegd is. Het lijkt een onbekende wereld waar volgens mij zeer veel kennis van security en netwerk voor vereist is. Er werd wel gezegd dat er, zoals bij elke job, veel kans is om bij te leren op de werkvloer. Toch denk ik dat dit allemaal iets te verschillend is van mijn huidige opleiding als applicatieontwikkelaar. Toch houd ik dit aanbod in gedachte naar later toe, moest ik me hierover ooit bedenken.",
        "selected": "False",
        "images": "rccu.PNG"
    },
    {
        "id": 2,
        "name": "Google Hash Code 2021",
        "location": "Sint-Truiden",
        "text": "Donderdag 25 februari 2021 om half zeven ‘s avonds vond de jaarlijkse editie van Google Hash Code plaats. Deelnemers kregen een technisch probleem voorgeschoteld waarna ze iets minder dan vier uur de tijd kregen om dit probleem op te lossen. Dit was een online gebeuren aangezien iedereen ter wereld de optie had om mee te doen. Wel werden hubs georganiseerd. Een hub is een overkoepelende groep waar je je als team bij kan aansluiten. Elke hub had eveneens een apart scorebord. <br> <br> Ik vormde samen met medestudent Tibo Tips een team om aan deze competitie deel te nemen, onder de team naam “PXL_team_8”. Ook hadden we ons team aangesloten bij de Info Support BE hub. Info Support bood toegang tot een virtuele ruimte via Gather Town. Via deze website kan je een karakter bewegen doorheen een virtuele zaal, in combinatie met het gebruik van een camera en een microfoon. In deze zaal is het mogelijk om met verschillende objecten te interageren. Zo kan een team aan een tafel gaan zitten, waardoor enkel de teamleden nog verstaanbaar zijn. Dit was een leuk initiatief van de hub organisatoren om verschillende teams samen te brengen tijdens de hackathon. <br> <br> De ronde waaraan we meededen was een kwalificatieronde. De winnaars van deze ronde krijgen de kans om mee te doen aan de finale. De bedoeling in deze kwalificatieronde is om zoveel mogelijk punten te scoren door een programma en een output bestand op te leveren. Het Judge System controleert deze output file en geeft afhankelijk van wat er in staat een score. Dit is de bedoeling voor zes bestanden. Ook hebben we als team besloten om mee te doen aan de practice round. Deze ronde diende om de teams een eerste indruk van een probleemstelling te geven en om hen te laten wennen aan het  Judge System. Ons voornemen voor elke ronde was om zoveel mogelijk punten te scoren door elk teamlid zijn eigen oplossing te laten uitwerken. Op deze manier waren we beiden aan het werk en was de kans om punten te scoren het grootst. <br> <br> In aanloop naar de hackathon hebben mijn teamgenoot en ik tweemaal samengezeten via Microsoft Teams om ons grondig voor te bereiden. Dit door aan de eerder besproken practice round mee te doen. Hier betrof het een probleem met pizza’s, waar punten verdiend konden worden door verschillende teams zoveel mogelijk pizza’s met zoveel mogelijk verschillende soorten ingrediënten op te bezorgen. Zowel mijn teamgenoot als ikzelf maakten de opdracht in de programmeertaal waar ieder het snelst mee was. Voor mij was dit Python, voor mijn teamgenoot Java. Na twee sessies hadden we helaas nog niet veel resultaat geboekt omdat de vraag toch een aantal niveaus hoger was dan we hadden geanticipeerd. Ik besloot de volgende dagen nog even over de vraag te beredeneren en heb uiteindelijk een werkend programma gemaakt. Deze leverde 65 punten op voor het eerste input bestand en ongeveer 9000 punten voor het tweede. Het derde bestand had een aanzienlijke verwerkingstijd zodat er werd besloten deze berekening stop te zetten omdat de zekerheid er was dat het programma werkte. <br> <br> De dag van de hackathon spraken mijn teamgenoot en ik een kwartier op voorhand af via Microsoft Teams. De hackathon zelf begon met een videoclip die ongeveer een kwartier duurde. Hierin werd iets meer verteld over het onderwerp van het probleem. Eveneens was er een herhaling van de info betreffende de opbouw van de avond en de te volgen regels. Hierna werd de opgave vrijgegeven. Mijn teamgenoot en ik begonnen met deze gezamenlijk door te nemen zodat we zeker waren dat we die beiden begrepen. Dit nam redelijk wat tijd in beslag aangezien de opdracht uit meerdere pagina’s bestond en de probleemstelling redelijk complex was. Eens dit gedaan was schakelden we volledig over naar de virtuele hub en werd de vergadering in Microsoft Teams enkel nog maar gebruikt om ons scherm te delen bij vragen. Opnieuw koos ieder voor zijn taal naar wens, om zo te verzekeren dat we beiden zo efficiënt mogelijk konden werken. Ik koos opnieuw voor Python en mijn teamgenoot voor Java. De opdracht betrof het zodanig afstemmen van verkeerslichten zodat iedere auto in het verkeer zo snel mogelijk zijn route kon afleggen. <br> <br> Als team begonnen we logischerwijs met het eerste en kleinste input bestand te gebruiken. Gedurende de uitwerking hiervan hebben we continu onze aanpak met elkaar besproken. Als eerste heeft ieder code geschreven om het bestand in te lezen. Daarna was er nood om de data op te delen. Eens dit gebeurd was, kon het denkwerk beginnen. Het input bestand was een tekstbestand dat info bevatte zoals onder andere de straatnamen en intersecties. Een eerste vondst was het uittekenen van het scenario in het eerste input bestand. Deze visualisatie maakte het probleem beter begrijpelijk. Het doel was om een programma te schrijven op basis van het eerste input file, dat de andere bestanden ook zonder probleem zou kunnen verwerken. Dit bleek echter moeilijker dan verwacht. Middels de routes van elke auto met elkaar te vergelijken kon het aantal verkeerslichten die aanpassing nodig hadden achterhaald worden. Ook werd informatie verwerkt betreffende de straten en aan welke intersecties deze uitkwamen. Hierna beredeneerden we over een formule om de optimale tijd voor elk verkeerslicht te berekenen. Op deze formule hebben we als team toch lang vastgezeten zonder al te veel resultaat. Hierna bleef er helaas nog maar één uur over en was het scorebord dus al stilgezet. Dit gebeurde om de spanning op te drijven. Omdat we hier veel te lang op vast zaten, probeerde ik het probleem op te lossen door zoveel mogelijk verkeerslichten op groen te zetten. Dit leverde een score van 2000 punten op voor het eerste input bestand. De code werd vervolgens aangepast om ze meer toepasselijk te maken voor het tweede bestand, maar hier zat helaas nog een fout in die ik er niet tijdig uitkreeg. Na de deadline verzamelde iedereen in de virtuele hub in het centrum om samen onze ervaring te bespreken en om de laatste presentatie van Google te volgen. De wedstrijd eindigde met de samenvatting van de hoogtepunten en een activatie van het scorebord. Hieruit bleek dat we op plaats dertien van de achttien in de Info Support Hub waren gestrand. <br> <br> Als ik terugkijk op dit evenement ben ik redelijk teleurgesteld over onze eindscore. Als we vanaf het begin de focus hadden gelegd op het schrijven van een heel simpele oplossing die een oké resultaat zou geven voor elk bestand, zoals we op het einde hadden gedaan, hadden we hoogstwaarschijnlijk meer punten gescoord. Dit neemt niet weg dat ik het een geslaagd evenement vond. <br> <br> Het grootste probleem voor mij was tijdsnood. De practice round had eveneens meer tijd in beslag genomen dan vier uur. Door deze oefenronde te maken wist ik dat tijd een bepalende factor ging worden. Ik heb daarom geprobeerd om zo snel mogelijk door te werken tijdens de kwalificatieronde om zoveel mogelijk punten te halen. Dit mocht helaas niet baten. <br> <br> De technische vragen van Google, zowel in de oefenronde als in de kwalificatieronde mochten dan wel moeilijk zijn, toch was het boeiend om naar een oplossing te zoeken. Info Support heeft met behulp van de virtuele ruimte de hackathon iets meer als een hackathon doen aanvoelen. Ik ben blij dat ik uiteindelijk een antwoord heb kunnen vinden voor de vraag in de oefenronde en ook dat we als team punten hebben kunnen scoren in de kwalificatieronde. <br> <br> Iets wat beter kon en wat ik dus zeker ga onthouden voor eventuele andere hackathons, is de manier waarop we de hackathon hebben aangepakt. Een iets makkelijkere oplossing zoals we op het einde gevonden hadden, zou de score verhoogd hebben. Indien de aard van de hackathon het toelaat is het dus best om in het vervolg te beginnen met het vinden van een makkelijke oplossing. Een van mijn sterke punten was dat ik goed voorbereid was door deel te nemen aan de oefenronde. Ook de communicatie binnen het team verliep heel goed. Zo hebben we doorheen de activiteit vaak onze ondervindingen gedeeld en elkaar geholpen wanneer iemand het probleem op een iets andere manier probeerde op te lossen. Het moeilijk kunnen werken onder tijdsdruk is een van mijn zwakke punten die naar boven kwam gedurende deze hackathon. <br> <br> Door het traject binnen mijn opleiding, waar Python de voornaamste taal is, heb ik geleerd snel te programmeren in deze taal. Hierdoor verliep het schrijven van code erg vlot.  <br> <br> Het werd aangeraden om deze activiteit op te nemen in het portfolio, maar zelfs als dat niet zo was zou ik deze activiteit nog vermeld hebben. Dit omdat het ten eerste een unieke ervaring was om aan een internationale hackathon deel te nemen. Ook de probleemstellingen zelf waren interessant om op te lossen. Daarom overweeg ik misschien om volgend jaar opnieuw deel te nemen. Er staan alvast veel gelijkaardige problemen online die als oefening kunnen dienen voor volgend jaar. <br> <br> Ik kan dus alleen maar tot het besluit komen dat de Hash Code competitie van Google een unieke ervaring was die zonder enige twijfel verschilt van andere hackathons waar ik ooit over gehoord of aan meegedaan heb. ",
        "selected": "False",
        "images": "hashcode1.PNG,hashcode2.PNG,hashcode3.PNG"
    },
    {
        "id": 3,
        "name": "event ha 1",
        "location": "Hasselt",
        "text": "",
        "selected": "False",
        "images": "test.png, test2.png"
    },
    {
        "id": 4,
        "name": "event st 4",
        "location": "Sint-Truiden",
        "text": "",
        "selected": "False",
        "images": "test.png, test2.png"
    },
    {
        "id": 5,
        "name": "event ha 2",
        "location": "Hasselt",
        "text": "",
        "selected": "True",
        "images": "test.png, test2.png"
    },
    {
        "id": 6,
        "name": "event br 1",
        "location": "Brussel",
        "text": "",
        "selected": "True",
        "images": "test.png, test2.png"
    }
    
]