[
    {
        "text": "Ik ben Mikail Mercan, student aan Hogeschool PXL. Ongeveer vier jaar geleden wandelde ik voor het eerst Hogeschool PXL binnen om te beginnen aan een opleiding toegepaste informatica. Het plan op dat moment was om af te studeren als <i>full-stack developer</i>. Gedurende mijn tijd aan deze hogeschool kwam er echter het traject <i>AI & robotics</i> bij. Dit veranderde mijn visie op de toekomst al snel aangezien dit onderwerp me al altijd geïnteresseerd heeft. Een andere bezigheid van mij is muziek, ik speel ondertussen ongeveer acht jaar gitaar. Ook ga ik de laatste vier jaar drie of vier keer per week naar de fitness. <br> <br> Ik weet van mezelf dat ik graag doorwerk tot alles volledig af is. Een van mijn sterke maar tegelijk ook zwakke punten is daarom volharding. Dit kwam tot uiting bij de POP-sessie rond kernkwadranten. Wanneer er een fout in mijn code zit, blijf ik hier meestal onophoudelijk naar verder zoeken tot deze gevonden is. Dit heeft zijn voordeel aangezien uiteindelijk de fout zo goed als altijd gevonden wordt. Het nadeel hieraan is wel dat dit redelijk wat tijd in beslag kan nemen en ik soms te lang op hetzelfde blijf vastzitten. Python is één van mijn favoriete programmeertalen. Dit deels omdat deze vaak nodig was binnen het traject <i>AI & robotics</i>. Iets wat ik bijgevolg graag doe is code schrijven in Python, voornamelijk voor kleinschalige doordenkers zoals <i>pathfinding</i> aan de hand van het A*-algoritme. <br> <br> Ik ben van plan om na mijn loopbaan aan Hogeschool PXL voor een masterdiploma te gaan. Over het soort bedrijf waar ik later terecht wil komen ben ik nog niet zeker. Ik houd voor deze beslissing graag nog alle wegen open. Wanneer een opportuniteit zich de kop opsteekt wil ik die zonder enig vooroordeel kunnen evalueren. De zaken die ik momenteel  geleerd heb gedurende mijn tijd aan Hogeschool PXL zullen zeker van pas komen in de toekomst. Iets wat ik graag nog bij zou leren is C++. Ik ben van plan dit te doen tijdens de zomervakantie."
    }
]